xusonghan/SWM34S-LVGL/applications/main.c
/*
 * Copyright (c) 2006-2022, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 */

#include <rtthread.h>
#include <rtdevice.h>
#include "board.h"
#include <stdlib.h>
#include "SWM341_sfc.h"

/*
 * Simple dumper for external flash window (e.g., 0x70000000)
 * Usage in MSH: sfc_dump [addr] [len]
 *   addr: start address, default 0x70000000 (accepts 0x...)
 *   len : number of bytes to dump, default 0x80
 */
static int sfc_dump(int argc, char *argv[])
{
    unsigned long addr_ul = 0x70000000UL;
    unsigned long len_ul  = 0x80UL;

    if (argc >= 2) addr_ul = strtoul(argv[1], RT_NULL, 0);
    if (argc >= 3) len_ul  = strtoul(argv[2], RT_NULL, 0);

    rt_uint32_t remaining = (rt_uint32_t)len_ul;
    rt_uint32_t cur = 0;

    while (remaining > 0)
    {
        rt_uint32_t line = remaining > 16 ? 16 : remaining;
        unsigned long line_addr = addr_ul + cur;
        rt_kprintf("0x%08lx: ", line_addr);

        // 以32位对齐读取，兼容仅支持字访问的AHB窗口
        unsigned long aligned = line_addr & ~0x3UL;
        rt_uint32_t start_off = (rt_uint32_t)(line_addr - aligned);
        rt_uint32_t need = start_off + line;
        rt_uint32_t words = (need + 3) / 4;

        for (rt_uint32_t i = 0; i < words; i++)
        {
            volatile const rt_uint32_t *wp = (volatile const rt_uint32_t *)(aligned + i * 4);
            rt_uint32_t w = *wp;
            // 将读到的一个字拆成4个字节（小端）
            rt_uint8_t b[4] = { (rt_uint8_t)(w & 0xFF), (rt_uint8_t)((w >> 8) & 0xFF), (rt_uint8_t)((w >> 16) & 0xFF), (rt_uint8_t)((w >> 24) & 0xFF) };

            // 根据起始偏移与剩余长度选择要输出的字节
            rt_uint32_t from = 0, to = 4;
            if (i == 0) from = start_off;
            if (i == words - 1)
            {
                rt_uint32_t total_bytes = start_off + line;
                rt_uint32_t last_bytes = total_bytes - (i * 4);
                if (last_bytes < 4) to = last_bytes;
            }

            for (rt_uint32_t j = from; j < to; j++)
            {
                rt_kprintf("%02X", b[j]);
                // 视觉分隔：第8个字节后加双空格
                unsigned printed = (i * 4 + j) - start_off + 1;
                if (printed == 8) rt_kprintf("  "); else rt_kprintf(" ");
            }
        }

        // 行尾补齐对齐空格（如果不足16字节）
        if (line < 16)
        {
            for (rt_uint32_t i = line; i < 16; i++)
            {
                if (i == 8) rt_kprintf("   ");
                else rt_kprintf("   ");
            }
        }
        rt_kprintf("\n");
        cur += line;
        remaining -= line;
    }
    return RT_EOK;
}
MSH_CMD_EXPORT(sfc_dump, dump external flash: sfc_dump [addr] [len]);

/* 打印 JEDEC ID：验证外部Flash识别是否正常 */
static int sfc_id(int argc, char *argv[])
{
    uint32_t id = SFC_ReadJEDEC();
    rt_kprintf("JEDEC: 0x%06X (MF=0x%02X, ID=0x%02X%02X)\n", id & 0xFFFFFF, (id & 0xFF), (id >> 16) & 0xFF, (id >> 8) & 0xFF);
    return RT_EOK;
}
MSH_CMD_EXPORT(sfc_id, read SPI NOR JEDEC ID);

/* 运行态设置 SFC 读模式（默认切到 0x03 单线），便于快速验证 */
static int sfc_set_read(int argc, char *argv[])
{
    uint32_t cmd = 0x03;
    uint32_t width = 1; /* 1: 单线, 4: 四线 */
    if (argc >= 2) cmd = strtoul(argv[1], RT_NULL, 0);
    if (argc >= 3) width = strtoul(argv[2], RT_NULL, 0);

    SFC_InitStructure cfg;
    cfg.ClkDiv = SFC_CLKDIV_2; /* 适中时钟，稳定优先 */
    cfg.Cmd_Read = (uint8_t)cmd;
    cfg.Width_Read = (width == 4) ? SFC_RDWIDTH_4 : SFC_RDWIDTH_1;
    cfg.Cmd_PageProgram = 0x32;
    cfg.Width_PageProgram = SFC_PPWIDTH_4;
    SFC_Init(&cfg);

    rt_kprintf("SFC read set: cmd=0x%02lX, width=%lu-line\n", cmd, width);
    return RT_EOK;
}
MSH_CMD_EXPORT(sfc_set_read, set read mode: sfc_set_read [cmd] [width(1|4)]);

/* 比较外部Flash(默认0x70000000)与执行区(默认0x80200000)的数据 */
static int sfc_cmp(int argc, char *argv[])
{
    unsigned long src = 0x70000000UL;
    unsigned long dst = 0x80200000UL; /* ER_SDRAM2 典型执行地址 */
    unsigned long len = 0x200;       /* 默认比较 512B */
    if (argc >= 2) src = strtoul(argv[1], RT_NULL, 0);
    if (argc >= 3) dst = strtoul(argv[2], RT_NULL, 0);
    if (argc >= 4) len = strtoul(argv[3], RT_NULL, 0);

    rt_uint32_t mism = 0;
    for (rt_uint32_t i = 0; i < (rt_uint32_t)len; i++)
    {
        rt_uint8_t a = *(volatile rt_uint8_t *)(src + i);
        rt_uint8_t b = *(volatile rt_uint8_t *)(dst + i);
        if (a != b)
        {
            if (mism < 8) /* 打印前几个不一致样本 */
                rt_kprintf("mismatch @+0x%08X: src=%02X dst=%02X\n", i, a, b);
            mism++;
        }
    }
    if (mism == 0) rt_kprintf("cmp OK: %lu bytes equal\n", len);
    else rt_kprintf("cmp FAIL: %lu mismatches in %lu bytes\n", (unsigned long)mism, len);
    return RT_EOK;
}
MSH_CMD_EXPORT(sfc_cmp, compare: sfc_cmp [src=0x70000000] [dst=0x80200000] [len]);

/* 将外部Flash窗口数据拷贝到执行区（用于在运行态修复拷贝） */
static int sfc_copy(int argc, char *argv[])
{
    unsigned long src = 0x70000000UL;
    unsigned long dst = 0x80200000UL;
    unsigned long len = 0;
    if (argc >= 2) src = strtoul(argv[1], RT_NULL, 0);
    if (argc >= 3) dst = strtoul(argv[2], RT_NULL, 0);
    if (argc >= 4) len = strtoul(argv[3], RT_NULL, 0);
    if (len == 0) {
        rt_kprintf("usage: sfc_copy [src] [dst] [len]\n");
        return -RT_ERROR;
    }
    /* 以32位为主拷贝，收尾处理不足对齐部分 */
    rt_uint32_t i = 0;
    for (; i + 4 <= (rt_uint32_t)len; i += 4)
    {
        rt_uint32_t w = *(volatile rt_uint32_t *)(src + i);
        *(volatile rt_uint32_t *)(dst + i) = w;
    }
    for (; i < (rt_uint32_t)len; i++)
    {
        *(volatile rt_uint8_t *)(dst + i) = *(volatile rt_uint8_t *)(src + i);
    }
    rt_kprintf("copy done: %lu bytes from 0x%08lX to 0x%08lX\n", len, src, dst);
    return RT_EOK;
}
MSH_CMD_EXPORT(sfc_copy, copy: sfc_copy [src=0x70000000] [dst=0x80200000] [len]);

#define LED_PIN GET_PIN(D,14)

int main(void)
{
    int count = 1;

    rt_pin_mode(LED_PIN, PIN_MODE_OUTPUT);

    while (count++)
    {
        rt_pin_write(LED_PIN, PIN_HIGH);
        rt_thread_mdelay(500);
        rt_pin_write(LED_PIN, PIN_LOW);
        rt_thread_mdelay(500);
    }

